[UI_TREE]
Machine = Hardware
POWER=Caratteristiche di potenza
TOUCH=Impostazione del pedale

[IPG,CO2]
MPULSE_FREQ=Mantenere la frequenza degli impulsi (khz)
MPULSE_RELS=tempo di rilascio prolungato (us)

[IPG]
MO_DELAY_STEPS = MO delay (us)
MODECHG_DELAY = ritardo di commutazione della modalità (ms)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE = Inserire il valore corrente nella finestra di dialogo
WORK_CURRENT_TYPEOption = Layer 0 current|Imposta valore
WORK_CURRENT = Imposta corrente di lavoro (A)

[ALL]
SAFE_DOOR = Protezione porta di sicurezza
SAFE_DOOROption =Non valido|Pausa|Annulla
MARKEND_SCAN = posizione del galvanometro finale
MARKEND_SCANOption=Origine|In alto a sinistra|Posizione in alto al centro|Centro in alto a destra|Centro in basso|Centro in basso|Angolo in basso|Angolo in basso|Angolo sinistro|Centro sinistro|Posizione personalizzata
MARKEND_X = X durante la personalizzazione (mm)
MARKEND_Y = Y durante la personalizzazione (mm)

[SCAN]
PREHEAT_ENABLE = Il galvanometro richiede il preriscaldamento
PREHEAT_ENABLEOption = No|Sì
PREHEAT_TIME = Tempo minimo di preriscaldamento (minuti)
USE_LIMIT_JUMPDELAY =Indica se abilitare il ritardo di salto
USE_LIMIT_JUMPDELAYOption = No|Sì
LIMIT_JUMPLEN = Distanza di salto limite (mm)
LIMIT_JUMPDELAY_MM = Tempo di salto per mm (noi)

[BitmapPower]
BitmapPower = marcatura bitmap in scala di grigi
AUT_TIME=tempo di decadimento (noi)
AUT_COFF=Coefficiente di guadagno (0-1)

[Signal]
Signal = Impostazione segnale
Cycle = Attiva più volte efficace
MARK_CNT = quante volte segnare con un singolo comando di marcatura
DELAY = Ritardo dopo l'attivazione (ms)
DLY_BETWEEN_MARK = Ritardo tra due marcature (ms)
MARK_END_DELAY = Ritardo dopo il completamento della marcatura (ms)
MARK_END_PULSE_W = marcatura della lunghezza del segnale finale (ms)
B_MARK_ONCE = Modalità trigger
B_MARK_ONCEOption = Level Trigger|Edge Trigger
Enable_Loop_Mdt = Marcatura del ciclo dopo offline
Enable_Loop_MdtOption = Non abilitato|abilitato
IOSELCOUNT = Numero di segnali I/O selezionati del documento
ENABLE_CARDTOUCH = Macchina inferiore attivata
ENABLE_CARDTOUCHOption = Non abilitato|abilitato

[UI_FACE]
ExportSysPara = Parametri di esportazione
ImportSysPara = Parametri di importazione
Ok = OK
Cancel = Annulla
Apply = Applica

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]

0=Laser hardware parametro di configurazione Guidata

1=Passaggio precedente

2=Accanto

3=Salva

4=Annulla


[DIALOG_POWER]

0=Secondo passo: impostare la tua selezionato laser configurazione hardware

1=Campo di regolazione della corrente(%)

2=Corrente minima(%):

3=Corrente massima(A):

4=AnalogicoQAuto

5=DigitaleQAuto

6=QTipo di unità

7=Tipo di alimentazione

8=CO2Laser di potenza dimensioni

9=L'alimentazione ordinaria

10=Alimentazione a risposta rapida

11=Maggiore o uguale a100W

12=A meno di100W

13=Il sustain pulse

14=Frequenza(KHZ)

15=Tempo di rilascio(ci)

16=Inattivo corrente(%):

17=Ciclo di servizio massimo

18=Corrente di compensazione（%）

19=Laser hardware

20=MImpostare il valore della

21=MValore:

22=Fattore di rettifica:

23=Normale

24=Troppo grande

25=Troppo piccolo


[DIALOG_MODEL]

0=Quarto passo: secondo il vostro gradimento, scegli il tuo Preferito modalità di controllo

1=Un nuovo modo di controllo, funzionamento semplice, gli utenti non è necessario impostare alcun ritardo,Ma solo nella porzione di laser utilizzato.

2=I laser tradizionali modalità di controllo, in linea con la maggior parte delle persone abitudini di utilizzo, tutti i laser possono essere utilizzati in questo modo.

3=Modalità facile

4=Modalità tradizionale

5=Marcatura Laser modalità di controllo

6=Testa quadrata tipo

7=Singolo in modalità testa a

8=Dual-head modalità


[DIALOG_LaserType]

0=Tipo del Laser:

1=YAGLaser

2=DPLaser

3=Laser UV

4=CO2Laser

5=TonoQLaser a fibra

6=SPILaser

7=LDLaser

8=YLPM(HFM-H)Laser

9=YLP-V2Laser

10=YLPPLaser

11=HFM-UNLaser

12=HFM-PLaser

13=HFM-RLaser

14=HFM-JLaser

15=MOPARegolabile in larghezza di impulso del laser

16=laser a fibra continua

17=Laser ultra veloce


[DIALOG_CONTENT]

0=Quinto passo: complimenti a te, le tue impostazioni sono state completate, si prega di salvare i parametri rilevanti


[LaserType_Explain]

0=YAGLaser

1=DPLaser

2=Laser UV

3=CO2Laser

4=TonoQLaser a fibra

5=SPILaser

6=LDLaser

7=MoPaLaser a fibra

8=YLP-V2Laser

9=YLPPLaser

10=HFM-UNLaser

11=HFM-PLaser

12=HFM-QLaser

13=HFM-JLaser

14=altro


[Model_Explain]

0=CO2 Modalità facile

1=CO2 Modalità tradizionale

2= TonoQ Normale alimentazione+DigitaleQ Modalità tradizionale

3= TonoQ Normale alimentazione+AnalogicoQ Modalità tradizionale

4= TonoQ, Alimentazione a risposta rapida+DigitaleQ Modalità tradizionale

5= TonoQ, Alimentazione a risposta rapida+AnalogicoQ Modalità tradizionale

6= TonoQ Normale alimentazione+AnalogicoQ Modalità facile

7= TonoQ, Alimentazione a risposta rapida+DigitaleQ Modalità facile

8= TonoQ, Alimentazione a risposta rapida+AnalogicoQ Modalità facile

9= IPG Modalità di

10=SPI Modalità facile

11=SPI Modalità tradizionale

12=LD Modalità di

13=YLPM(HFM-H) Modalità tradizionale

14=YLPM(HFM-H) Modalità facile

15=YLP-V2 Modalità tradizionale

16=YLP-V2 Modalità facile

17=YLPP Modalità tradizionale

18=YLPP Modalità facile

19=HFM-UN Modalità tradizionale

20=HFM-UN Modalità facile

21=HFM-P Modalità tradizionale

22=HFM-P Modalità facile

23=HFM-R Modalità tradizionale

24=HFM-R Modalità facile

25=HFM-J Modalità tradizionale

26=HFM-J Modalità facile


[DIALOG_ScanType]

0=Terzo passo: Set galvanometro tipo

1=Fatti in casa galvanometro

2=Altre galvanometro

3=Suggerimenti:Si prega di selezionare la macchina corrispondente al galvanometro tipo, Fatti in casa galvanometro dopo l'accensione di warm-up per poter funzionare correttamente,Altre galvanometro senza preriscaldamento
;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------


;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0 = Interrompi la lavorazione della porta di ingresso
STATIC_1 = Interrompi la lavorazione della porta di uscita
STATIC_2 = Porta di uscita
STATIC_3 = Ripari mobili
STATIC_4 = Porta di ingresso
STATIC_5 = Il laser è pronto per l'uscita
STATIC_6 = Porta di ingresso
STATIC_7 = Porta di uscita
STATIC_8 = Output pronto per il software
STATIC_9 = porta di uscita
STATIC_10 = potenza di uscita laser
STATIC_11 = porta
STATIC_12 = Uscita di indicazione luminosa rossa esterna
STATIC_13 = porta di uscita
STATIC_14 = Porta di ingresso
STATIC_15 = Accompagnamento marcato
STATIC_16 = porta di uscita
STATIC_17 = Fine dell'output di marcatura
STATIC_18 = porta di uscita
STATIC_19 = larghezza dell'impulso
STATIC_20 = uscita allarme laser fibra
STATIC_21 = Porta di uscita
STATIC_22 = Inizia a contrassegnare la porta
STATIC_23 = Porta di ingresso
IDC_CHECK_LASERWARN = Allarme laser di rilevamento
IDC_CHECK_PLUSE_REVERSE = Inversione del livello del segnale Q
IDC_RADIO_NORMAL = Standard
IDC_RADIO_BICOLORLAMP = Luce bicolore
IDC_RADIO_TRICOLORLIGHT = Luce tricolore

[error]
1=Carta non inizializzata o non può essere trovata!
2=reset fallito!
3=Versione sbagliata della carta!
4=Allarme!
6=esecuzione fallita!
7=status non corrisponde!
16=timeout del comando!
17=Comando perso!
18=chiamata di interfaccia asincrona!
19=interfaccia occupata da altri programmi!
20=L'asse Z supera il limite o il file di correzione è danneggiato!
21=disallineamento dei parametri!
23=allocazione memoria fallita!
100=in uso offline!
101=comando interrotto!
1001=Porta 1
1002=Porta 2
1003=Porta 3
1004=Porta 4
1005=porta 5
1006=porta 6
1007=porta 7
1008=ingresso laser non pronto
1009=ingresso laser pronto

;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG= Impostazione laser
IDD_PROPPAGE_POWER= caratteristiche dell'alimentatore
IDD_PROPPAGE_SYS_SET=Impostazioni hardware
IDD_PROPPAGE_TOUCH= Impostazioni pedale
IDD_PORT_SET = Impostazioni porta

[IDD_DIALOG_HANSLASERSET]
CAPTION= IMPOSTAZIONI DI SISTEMA
IDC_BTN_SAVE= Conservare
IDCANCEL= Quit
LISTTITLE_NAME= Nome dell'articolo
LISTTITLE_VALUE= Valore

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------